{
  "noteId": "note_1767263457378",
  "thought": " the biggest bottle net that every time I was facing with cloud code was dedicating the task to the subways, creating suburbans delegating task to the suburbs, basically managing the context window now that bottleneck has been taken care a lot by clout code the biggest bottle net that every time I was facing with cloud code was dedicating the task to the subways, creating suburbans delegating task to the suburbs, basically managing the context window now that bottleneck has been taken care a lot by clout code built-in subversions sub agents and I feel this is the big win for me because I don't like us that I like cloud code and the whole concept of an understanding what the conversation is and understanding that it needs a research or maybe a task or maybe a explore it's assigning the relevant agents that are being used most or I had to create on my side. Let's research agent or something which is used a lot in every project. It is spinning up that saving my context window and I can work more plus with cloud, Op. 4.5 help that's helping me a lot because hones Claude Op. 4.5 is uses very less tokens compared to other models so that is like the cherry on the cake one bottleneck is now apparently Clat code has started writing the plants in its Clat directory and every time I'm in the plan mode it reads through those plans written in a random MDMD file with weird name and it's reading through that even although it should go through the my docs where I have all the plans that is something which creates a confusion. I have to literally type in the explicit instructions to take the plant from my docs now that is a new problem that I have but Claude God is going in a good direction.",
  "content": {
    "twitter": "[\"Claude Code's auto-delegation is legit. Ask for something complex, it spins up research or plan sub-agents automatically. My custom sub-agents are collecting dust now.\", \"Context window management is what sells it. Claude decides when to delegate vs handle directly, keeps the main context clean. Opus 4.5 made this smoother—fewer tokens, longer sessions.\", \"One quirk: Claude started dumping plans into random .md files I never asked for. Now it reads those instead of my actual docs. Gotta type \\\"read from my docs\\\" every time 😅\", \"Still the best terminal coding experience I've had. Anyone else finding auto-delegation kills the need for custom setups?\"]"
  },
  "platforms": [
    "twitter"
  ],
  "id": "post_1767264456653",
  "timestamp": "2026-01-01T10:47:36.653Z",
  "status": "published",
  "updatedAt": "2026-01-01T10:47:44.622Z",
  "published": {
    "twitter": {
      "success": true,
      "platform": "twitter",
      "type": "thread",
      "data": {
        "tweets": [
          {
            "id": "2006678706492993540",
            "url": "https://twitter.com/sanchit_verse/status/2006678706492993540",
            "text": "[\"Claude Code's auto-delegation is legit. Ask for something complex, it spins up research or plan sub-agents automatically. My custom sub-agents are collecting dust now.\", \"Context window management is what sells it.",
            "position": 1
          },
          {
            "id": "2006678714697003510",
            "url": "https://twitter.com/sanchit_verse/status/2006678714697003510",
            "text": "Claude decides when to delegate vs handle directly, keeps the main context clean. Opus 4.5 made this smoother—fewer tokens, longer sessions.\", \"One quirk: Claude started dumping plans into random .md files I never asked for. Now it reads those instead of my actual docs.",
            "position": 2
          },
          {
            "id": "2006678723005919487",
            "url": "https://twitter.com/sanchit_verse/status/2006678723005919487",
            "text": "Gotta type \\\"read from my docs\\\" every time 😅\", \"Still the best terminal coding experience I've had. Anyone else finding auto-delegation kills the need for custom setups?\"]",
            "position": 3
          }
        ],
        "threadUrl": "https://twitter.com/sanchit_verse/status/2006678706492993540"
      },
      "publishedAt": "2026-01-01T10:47:44.622Z"
    }
  }
}